import re


def clean_output(text):

    replacements = {
        "زبده جوان": "مخاطب جوان",
        "قهوه خفته": "قهوه‌ای گرم",
        "مینیمالی": "مینیمال",
        "عضوي": "ارگانیک",
        "۱۰۰۰,۰۰": "۱,۰۰۰,۰۰۰",
        "۲۵۰۰,۰۰": "۲,۵۰۰,۰۰۰",
        "مینیمالسم": "مینیمال",
        "Font Name": "نام فونت",
        "مینیمالستی": "مینیمال",
        "جوان آمیز": "جذاب برای مخاطب جوان",
        "сти л": "سبک",
        "стил": "سبک",
        "Browny": "قهوه‌ای",
        "Green Olive": "سبز زیتونی"
    }

    for old, new in replacements.items():
        text = text.replace(old, new)

    # حذف عبارت اضافه
    text = text.replace("قوانین دریافت شد.", "")

    # حذف فاصله‌های اضافی
    text = re.sub(r"\n{3,}", "\n\n", text)

    # حذف توضیحات اضافه
    if "قوانین کیفیت خروجی" in text:
        text = text.split("قوانین کیفیت خروجی")[0]

    return text.strip()